In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['Q','W','E','R'])

In [8]:
df

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
bool = df>0

In [17]:
df[df['Q']>0]

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['W']>0][['Q','E']]

          Q         E
A  2.706850  0.907969
C -2.018168  0.528813
E  0.190794  2.605967

In [42]:
df[(df['W']>0) & (df['E']>0)]

          Q         W         E         R
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df.reset_index()

  index         Q         W         E         R
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [46]:
newindes = "ca li for ni a".split()

In [50]:
df['state']= newindes

In [53]:
df.set_index('state')

              Q         W         E         R
state
ca     2.706850  0.628133  0.907969  0.503826
li     0.651118 -0.319318 -0.848077  0.605965
for   -2.018168  0.740122  0.528813 -0.589001
ni     0.188695 -0.758872 -0.933237  0.955057
a      0.190794  1.978757  2.605967  0.683509

In [55]:
df

          Q         W         E         R state
A  2.706850  0.628133  0.907969  0.503826    ca
B  0.651118 -0.319318 -0.848077  0.605965    li
C -2.018168  0.740122  0.528813 -0.589001   for
D  0.188695 -0.758872 -0.933237  0.955057    ni
E  0.190794  1.978757  2.605967  0.683509     a

In [63]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = ['1','2','3','1','2','3']
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
df = pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [71]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [74]:
df.loc['G1'].iloc[1]

A   -0.943406
B    0.484752
Name: 2, dtype: float64

In [83]:
df.index.names=['Groups','nums']
df

                    A         B
Groups nums
G1     1    -0.497104 -0.754070
       2    -0.943406  0.484752
       3    -0.116773  1.901755
G2     1     0.238127  1.996652
       2    -0.993263  0.196800
       3    -1.136645  0.000366

In [85]:
df.loc['G1'].iloc[1]['A']

-0.9434064032519315

In [97]:
df.xs(1,level='Groups')

KeyError: 1

In [99]:
d = {'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,4]}

In [101]:
df = pd.DataFrame(d)

In [103]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  4

In [105]:
df.dropna()

     A    B  C
0  1.0  1.0  1

In [108]:
df.dropna(axis=1)

   C
0  1
1  2
2  4

In [111]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [113]:
df.fillna(value="new value")

           A          B  C
0          1          1  1
1          2  new value  2
2  new value  new value  4

In [118]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [121]:
data={'company':['GOOG','GOOG','FB','FB','MSRT','MSRT'],
                 'worker':['ram','shyam','olla','brita','pita','sita'],
                 'salary':[100,200,400,500,900,1000]}

In [123]:
df= pd.DataFrame(data)

In [127]:
grpby = df.groupby('company')

In [130]:
grpby.mean()

         salary
company
FB          450
GOOG        150
MSRT        950

In [132]:
grpby.sum()

         salary
company
FB          900
GOOG        300
MSRT       1900

In [133]:
grpby.std()

            salary
company
FB       70.710678
GOOG     70.710678
MSRT     70.710678

In [135]:
grpby.sum().loc['FB']

salary    900
Name: FB, dtype: int64

In [140]:
grpby.max()

        worker  salary
company
FB        olla     500
GOOG     shyam     200
MSRT      sita    1000

In [141]:
grpby.count()

         worker  salary
company
FB            2       2
GOOG          2       2
MSRT          2       2

In [143]:
grpby.min()

        worker  salary
company
FB       brita     400
GOOG       ram     100
MSRT      pita     900

In [150]:
grpby.describe().transpose()['FB']

salary  count      2.000000
        mean     450.000000
        std       70.710678
        min      400.000000
        25%      425.000000
        50%      450.000000
        75%      475.000000
        max      500.000000
Name: FB, dtype: float64

In [154]:
df1 = pd.DataFrame({
        'A':['A0','A1','A2'],
        'B':['B0','B1','B2'],
        'C':['C0','C1','C2']
},index=[0,1,2])
df2 = pd.DataFrame({
        'A':['A3','A4','A5'],
        'B':['B3','B4','B5'],
        'C':['C3','C4','C5']
},index=[3,4,5])
df3 = pd.DataFrame({
        'A':['A6','A7','A8'],
        'B':['B6','B7','B8'],
        'C':['C6','C7','C8']
},index=[6,7,8])

In [158]:
pd.concat([df1,df2,df3],axis=1)

     A    B    C    A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8

In [4]:
import pandas as pd
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2' : [111,222,111,444],
    'col3' : ['abc','def','ghi','xyz'],
})

In [11]:
df['col2'].unique()

array([111, 222, 444], dtype=int64)

In [13]:
df['col2'].nunique()

3

In [16]:
df['col2'].value_counts()

111    2
222    1
444    1
Name: col2, dtype: int64

In [28]:
df[(df['col1']>2) & (df['col2']==111)]

   col1  col2 col3
2     3   111  ghi

In [31]:
def mul2(x):
    return 2*x

In [36]:
df['col1'].apply(mul2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [37]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [40]:
df['col2'].apply(lambda x:x*2)

0    222
1    444
2    222
3    888
Name: col2, dtype: int64

In [42]:
df.drop('col1',axis=1)

   col2 col3
0   111  abc
1   222  def
2   111  ghi
3   444  xyz

In [46]:
df.sort_values('col2')

   col1  col2 col3
0     1   111  abc
2     3   111  ghi
1     2   222  def
3     4   444  xyz

In [48]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [49]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [54]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Input and output

In [2]:
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv('example')

In [19]:
df.to_csv('MY_OUTPUT',index=False)

In [21]:
pd.read_csv('MY_OUTPUT')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [39]:
df=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [41]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet2')

In [42]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [46]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"